In [44]:
import   numpy as np
import pandas as pd

In [45]:
#multi_index
inside = ["class A","class B","class C","class A","class B","class C"]
outside = ["school 1","school 1","school 1","school 2","school 2","school 2"]

In [46]:
multi_index=list(zip(outside,inside))
multi_index

[('school 1', 'class A'),
 ('school 1', 'class B'),
 ('school 1', 'class C'),
 ('school 2', 'class A'),
 ('school 2', 'class B'),
 ('school 2', 'class C')]

In [47]:
hier_index=pd.MultiIndex.from_tuples(multi_index)
hier_index

MultiIndex([('school 1', 'class A'),
            ('school 1', 'class B'),
            ('school 1', 'class C'),
            ('school 2', 'class A'),
            ('school 2', 'class B'),
            ('school 2', 'class C')],
           )

In [48]:
np.random.seed(101)
df = pd.DataFrame(np.random.randint(70,100,size=(6,2)),index=hier_index,columns=["1st_semester","2st_semester"])
df

                  1st_semester  2st_semester
school 1 class A            81            87
         class B            76            93
         class C            99            81
school 2 class A            85            79
         class B            83            78
         class C            74            78

In [49]:
####################################################################################################################################

In [50]:
#eleman_se√ßme
df

                  1st_semester  2st_semester
school 1 class A            81            87
         class B            76            93
         class C            99            81
school 2 class A            85            79
         class B            83            78
         class C            74            78

In [51]:
df["1st_semester"]

school 1  class A    81
          class B    76
          class C    99
school 2  class A    85
          class B    83
          class C    74
Name: 1st_semester, dtype: int64

In [52]:
df[["1st_semester"]]

                  1st_semester
school 1 class A            81
         class B            76
         class C            99
school 2 class A            85
         class B            83
         class C            74

In [53]:
df[["2st_semester"]]

                  2st_semester
school 1 class A            87
         class B            93
         class C            81
school 2 class A            79
         class B            78
         class C            78

In [54]:
df.loc["school 1"]

         1st_semester  2st_semester
class A            81            87
class B            76            93
class C            99            81

In [55]:
df.loc["school 1"].loc[["class B"]]

         1st_semester  2st_semester
class B            76            93

In [56]:
df.index.names

FrozenList([None, None])

In [57]:
df.index.names=["schools","classes"]
df.index.names

FrozenList(['schools', 'classes'])

In [58]:
########################################################################################################################################################################

In [59]:
df

                  1st_semester  2st_semester
schools  classes
school 1 class A            81            87
         class B            76            93
         class C            99            81
school 2 class A            85            79
         class B            83            78
         class C            74            78

In [60]:
df.xs("school 2")

         1st_semester  2st_semester
classes
class A            85            79
class B            83            78
class C            74            78

In [61]:
df.xs(("school 2","class A"))

1st_semester    85
2st_semester    79
Name: (school 2, class A), dtype: int64

In [62]:
df.xs(("school 2","class A"), level=[0,1])

                  1st_semester  2st_semester
schools  classes
school 2 class A            85            79

In [65]:
df.xs("class A", level="classes")

          1st_semester  2st_semester
schools
school 1            81            87
school 2            85            79

In [69]:
df.xs("class A", level=1)

          1st_semester  2st_semester
schools
school 1            81            87
school 2            85            79